lesson-14/app/Http/Controllers/PostController.php

    public function getAllPosts(){


        return view("Posts",["Posts"=>Post::get()]);
---
select * from `posts`

    public function getRecentPosts()
    {
        $posts = Post::get();
        return view("Posts",["Posts"=>
            collect($posts)->reject(
                function($post){
                    $createTime = Carbon::parse($post->created_at)->addHour(2);
                    $nowDate = new Carbon;
                    return $createTime<$nowDate;
            })]);
---
select * from `posts`
insert into `posts` (`title`, `body`, `updated_at`, `created_at`) values ('41241', '4142142', '2022-07-25 17:13:56', '2022-07-25 17:13:56')

    public function getPost($id){
        $comments = Post::with('comments')
            ->find($id)->comments;
        $post = Post::select(['title','body','id'])->find($id);
---
select * from `comments` where `comments`.`post_id` is null and `comments`.`post_id` is not null
select * from `posts` where `posts`.`id` = '4' limit 1
select `title`, `body`, `id` from `posts` where `posts`.`id` = '4' limit 1

    public function createPost(Request $request){
        $post = new Post;
        $post->title = $request->title;
        $post->body = $request->body;
        $post->name = $request->name;
        $post->save();
---
insert into `posts` (`title`, `body`, `name`, `updated_at`, `created_at`) values ('Мой первый пост', 'Это первый пост', 'Максим', '2022-07-25 18:00:53', '2022-07-25 18:00:53')

    public function createComment(Request $request){
        $comment = new Comment;
        $comment->name = $request->name;
        $comment->body = $request->body;
        $comment->post_id = $request->post_id;
        $comment->save();
---
insert into `comments` (`name`, `body`, `post_id`, `updated_at`, `created_at`) values ('Вика', 'Да', '4', '2022-07-25 18:01:18', '2022-07-25 18:01:18')

    public function getAuthorComment($id){
        $targetPost = DB::table('posts')->where('id',$id);
        $comment = DB::table('comments')
            ->joinSub($targetPost,'targetPost',function($join){
                $join->on('targetPost.name','=','comments.name')
                    ->on('targetPost.id','=','comments.post_id');
            })
            ->select('comments.*')
            ->get();
---
select `comments`.* from `posts` inner join `comments` on `posts`.`name` = `comments`.`name` and `posts`.`id` = `comments`.`post_id`